while True:
    print("--------------------------------------------------------")
    print("（1:十转八 2:十转十六 3:十转二）")
    b=int(input("请选择转换类型：")) 
    a=int(input("请输入十进制数："))    
    print("")
    print("")
    if b==1:
       c=oct(a)     
       print("十进制数",a,"的八进制为：",c[2:])#将十进制整数转换为八进制
    elif b==2:
        c=hex(a)
        print("十进制数",a,"的十六进制为：",c[2:])#将十进制整数转换为十六进制
    else:
        c=bin(a)
        print("十进制数",a,"的二进制为：",c[2:])#将十进制整数转换为二进
    print("--------------------------------------------------------")
   
    

